{
  "Unit I": "Introduction: Engineering Graphics/Technical Drawing, Introduction to drawing equipments and use of instruments,  Conventions  in  drawing  practice.  Types  of  lines  and  their  uses,  BIS  codes  for  lines,  technical lettering as per BIS codes, Introduction to dimensioning, Types, Concepts of scale drawing, Types of scales Theory of Projections: Theory of projections, Perspective, Orthographic, System of orthographic projection: in reference to quadrants, Projection of Points, Projection in different quadrants, Projection of point on auxiliary planes, Distance between two points, Illustration through simple problems.",
  "Unit II": "Projection  of  Lines:  Line  Parallel  to  both  H.P.  and  V.P.,  Parallel  to  one  and  inclined  to  other,  Other  typical cases:  three  view  projection  of  straight  lines,  true  length  and  angle  orientation  of  straight  line:  rotation method, Trapezoidal method and auxiliary plane method, traces of line.",
  "Unit III": "Projection of Planes: Projection of Planes Parallel to one and perpendicular to other, Perpendicular to one and inclined to other, Inclined to both reference planes, Plane oblique to reference planes, traces of planes, Planes  Other  than  the  Reference  Planes:  Introduction  of  other  planes  (perpendicular  and  oblique),  their traces,  inclinations  etc.,  projections  of  points  and  lines  lying  in  the  planes,  conversion  of  oblique  plane  into auxiliary plane and solution of related problems.",
  "Unit IV": "Projection  of  Solids:  Projection  of  solids  in  first  or  third  quadrant,  Axis  parallel  to  one  and  perpendicular  to other,  Axis  parallel  to  one  inclined  to  other,  Axis  inclined  to  both  the  principal  plane,  Axis  perpendicular  to profile plane and parallel to both H.P. and V.P., Visible and invisible details in the projection, Use of rotation and auxiliary plane method, Development  of  Surface:  Purpose  of  development,  Parallel  line,  radial  line  and  triangulation  method, Development  of  prism,  cylinder,  cone and  pyramid  surface  for  both right  angled  and  oblique solids, Development of surface."
}