{
  "Unit I": "Review of Discrete Time Fourier Transform, Z-transform and Discrete Fourier Transform, Properties of the DFT: Periodicity, Linearity and Symmetry properties, Multiplication of two DFTs, concept of circular convolution, computation of circular convolution by graphical and matrix form, relationship between linear convolution and circular convolution, computation of linear convolution from circular convolution, linear filtering using DFT, aliasing error, filtering of long data sequences – Overlap-Save and Overlap-Add methods, Efficient computation of the DFT: Complexity analysis of direct computation of DFT, Concept of Fast Fourier transformation, Radix-2 computation of FFT using decimation-in-time and decimation-in-frequency algorithms, signal flow graphs, Butterflies, computations of FFT in one place using both algorithms, bit-reversal process, examples for DIT & DIF FFT Butterfly computations.",
  "Unit II": "Design & structure of FIR filters: Characteristics of practical frequency-selective filters, Basic concepts of IIR and FIR filters, Gibbs Phenomenon, Symmetric and Anti-symmetric FIR filters, Design of Linear-phase FIR filters using windows- Rectangular, Hamming, Hanning, Bartlett windows, FIR differentiator, FIR Hilbert Transformer. Design of FIR filters using frequency sampling method. Structure for FIR Systems: Direct form, Cascade form and Lattice structures.",
  "Unit III": "Design & Structure of IIR filters: Concept of IIR digital filter, recursive and non-recursive system-analog to digital domain transformation- Approximation of derivatives, impulse-invariant method and bilinear transformation and their properties, limitations of bilinear transformation, frequency warping and prewarping, methods to find out the order of IIR filter, mapping of poles and zeroes of filter in analog domain, computation of filter transfer function in analog domain, digital filter realization techniques, procedure to design Butterworth and Chebyshev digital IIR filters. Direct, Cascade, Parallel, Signal Flow graph and transposed structure, Lattice structures, Lattice and Lattice-Ladder Structures, Schur-Cohn stability Test for IIR filters.",
  "Unit IV": "Quantization Errors in Digital Signal Processing: Fixed point and floating point representation of numbers, Errors resulting from Rounding and Truncation, Digital Quantization of filter coefficients, Round-off effects in digital filters, Dead Band Effects. Multirate Digital Signal Processing: Decimation, Interpolation, Sampling rate conversion by a rational factor; Frequency domain characterization of Interpolator and Decimator; Polyphase decomposition, Applications of Multirate signal processing."
}