{
  "Unit I": "Introduction: Overview of Communication Systems, Types and Modes of Communication Systems, Frequency Spectrum of EM Waves, Mathematical Models for Communication Channels, Shannon-Hartley Law, Introduction to Random Variables: Probability, Concept of Random Variable (Stationary, Non-Stationary), Classification of Random Process (WSS, SSS), CDF, PDF, Joint CDF, Joint PDF, Marginal PDF, Mean, Moments, Central Moment, Auto-Correlation & Cross-Correlation, Covariance Functions, Ergodicity, Uniform Distribution, Gaussian Distribution, Rayleigh Distribution, Exponential Distribution, Binomial Distribution, Poisson Distribution, Wiener-Khinchine Theorem, Power Spectral Density.",
  "Unit II": "Amplitude Modulation: Need for Modulation, AM: Modulation and Demodulation, DSB-SC: Modulation and Demodulation, SSB: Modulation and Demodulation, VSB: Modulation and Demodulation, Power Relation, Modulation Index, Bandwidth Efficiency, Angle Modulation Systems: Frequency Modulation, Types of Frequency Modulation, Generation of NBFM, WBFM, Transmission BW of FM (NBFM, WBFM), Phase Modulation, Comparison of AM, FM & PM, Pulse Analog Modulation: Sampling-Ideal, Natural and Flat Top, Aliasing, Aperture Effect, Pulse Amplitude Modulation (PAM), Pulse Width Modulation (PWM), Pulse Position Modulation (PPM)-Generation and Recovery.",
  "Unit III": "Pulse Digital Modulation: Pulse Code Modulation (PCM), Differential Pulse Code Modulation (DPCM), Delta Modulation (DM), ADPCM, Digital Modulation and Transmission: Advantages of Digital Communication, Modulation & Detection of ASK, FSK, & PSK, Comparison.",
  "Unit IV": "Line Coding: Unipolar, Polar and Bipolar (AMI) NRZ & RZ, Manchester Encoding, Differential Manchester Encoding, High Density Bipolar Code, Binary with N-Zero Substitution Codes, Multiplexing: Time Division Multiplexing and Frequency Division Multiplexing, Information and Coding Theory: Entropy, Information, Channel Capacity, Source Coding Theorem: Shannon-Fano Coding, Huffman Coding."
}