{
  "Unit I": "Introduction to Thermodynamics: Fundamental Ideas of Thermodynamics, The Continuum Model, The Concept of a \"System\", \"State\", \"Equilibrium\", \"Process\". Equations of state, Heat, Zeroth Law of Thermodynamics, Work, first and second laws of thermodynamics, entropy",
  "Unit II": "Waves  and  Oscillations:    Wave  motion,  simple  harmonic  motion,  wave  equation,  superposition  principle. Introduction  to  Electromagnetic  Theory:  Maxwell’s  equations.    work  done  by  the  electromagnetic  field, Poynting’s  theorem,  Momentum,  Angular  momentum  in  electromagnetic  fields,  Electromagnetic  waves:  the wave equation, plane electromagnetic waves, energy carried by electromagnetic waves",
  "Unit III": "Interference:  Interference  by  division  of  wave  front  (Young's  double  slit  experiment,  Fresnel's  biprism), interference  by  division  of  amplitude  (thin  films,  Newton's  rings,  Michelson's  interferometer),  Coherence  and coherent sources, Diffraction:  Fraunhofer  and  Fresnel  diffraction;  Fraunhofer  diffraction  for  Single  slit,  double  slit,  and  N-slit (diffraction grating), Fraunhofer diffraction from a circular aperture, resolving power and dispersive power of a grating, Rayleigh criterion, resolving power of optical instruments, Polarization: Introduction to polarization, Brewster’s law, Malu's law, Nicol prism, double refraction, quarter-wave and half-wave plates, optical activity, specific rotation, Laurent half shade polarimeter.",
  "Unit IV": "Theory of relativity: The Michelson-Morley Experiment and the speed of light; Absolute and Inertial frames of reference, Galilean transformations, the postulates of the special theory of relativity, Lorentz transformations, time dilation, length contraction, velocity addition, mass energy equivalence. Invariance of Maxwell’s equations under Lorentz Transformation. Introduction to Laser Physics: Introduction, coherence, Einstein A and B coefficients, population inversion, basic principle and operation of a laser, the He-Ne laser and the Ruby laser"
}